9/data/attachments/f32ea857c607f7b2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_9a792671-dcaa-4f0d-97c6-eb921bf131e8</nif:username>
            <nif:friendToBeAdded>Amanda_pressure_Actions_4340_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>